results/4-loadtest/aws_results/aws_dotnet_25.txt
Running 1m test @ https://yr4jnlmdn9.execute-api.eu-central-1.amazonaws.com/test/dotnet_matrix
  2 threads and 25 connections
  Thread calibration: mean lat.: 50.565ms, rate sampling interval: 133ms
  Thread calibration: mean lat.: 71.218ms, rate sampling interval: 160ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    50.07ms   52.15ms 598.53ms   98.56%
    Req/Sec    12.58     28.17    90.00     84.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   45.09ms
 75.000%   50.65ms
 90.000%   58.43ms
 99.000%  504.32ms
 99.900%  588.29ms
 99.990%  599.04ms
 99.999%  599.04ms
100.000%  599.04ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      30.543     0.000000            1         1.00
      33.823     0.100000          126         1.11
      34.847     0.200000          252         1.25
      35.935     0.300000          375         1.43
      38.399     0.400000          502         1.67
      45.087     0.500000          624         2.00
      46.271     0.550000          687         2.22
      47.103     0.600000          749         2.50
      47.807     0.650000          813         2.86
      48.863     0.700000          874         3.33
      50.655     0.750000          938         4.00
      51.967     0.775000          968         4.44
      53.823     0.800000          999         5.00
      55.295     0.825000         1033         5.71
      56.415     0.850000         1062         6.67
      57.151     0.875000         1092         8.00
      57.663     0.887500         1108         8.89
      58.495     0.900000         1124        10.00
      59.423     0.912500         1139        11.43
      60.383     0.925000         1155        13.33
      61.631     0.937500         1170        16.00
      62.335     0.943750         1178        17.78
      62.655     0.950000         1186        20.00
      63.519     0.956250         1194        22.86
      66.047     0.962500         1203        26.67
      68.607     0.968750         1209        32.00
      70.271     0.971875         1213        35.56
      72.191     0.975000         1217        40.00
      80.575     0.978125         1221        45.71
      85.439     0.981250         1225        53.33
      97.599     0.984375         1229        64.00
     109.503     0.985938         1231        71.11
     120.255     0.987500         1233        80.00
     502.015     0.989062         1235        91.43
     504.319     0.990625         1237       106.67
     514.559     0.992188         1239       128.00
     516.095     0.992969         1240       142.22
     521.215     0.993750         1241       160.00
     522.751     0.994531         1242       182.86
     525.311     0.995313         1243       213.33
     526.335     0.996094         1244       256.00
     526.335     0.996484         1244       284.44
     528.895     0.996875         1245       320.00
     528.895     0.997266         1245       365.71
     532.991     0.997656         1246       426.67
     532.991     0.998047         1246       512.00
     532.991     0.998242         1246       568.89
     588.287     0.998437         1247       640.00
     588.287     0.998633         1247       731.43
     588.287     0.998828         1247       853.33
     588.287     0.999023         1247      1024.00
     588.287     0.999121         1247      1137.78
     599.039     0.999219         1248      1280.00
     599.039     1.000000         1248          inf
#[Mean    =       50.072, StdDeviation   =       52.146]
#[Max     =      598.528, Total count    =         1248]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1500 requests in 1.00m, 0.86MB read
Requests/sec:     24.93
Transfer/sec:     14.63KB