results/4-loadtest/aws_results/aws_dotnet_400.txt
Running 1m test @ https://yr4jnlmdn9.execute-api.eu-central-1.amazonaws.com/test/dotnet_matrix
  2 threads and 400 connections
  Thread calibration: mean lat.: 101.978ms, rate sampling interval: 271ms
  Thread calibration: mean lat.: 105.769ms, rate sampling interval: 245ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    48.95ms   25.59ms 719.87ms   95.93%
    Req/Sec   201.18    326.61   819.00     75.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   46.40ms
 75.000%   52.80ms
 90.000%   62.59ms
 99.000%   99.01ms
 99.900%  587.78ms
 99.990%  670.21ms
 99.999%  720.38ms
100.000%  720.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      29.967     0.000000            1         1.00
      35.679     0.100000         1984         1.11
      37.567     0.200000         3932         1.25
      39.807     0.300000         5890         1.43
      42.655     0.400000         7855         1.67
      46.399     0.500000         9825         2.00
      47.487     0.550000        10792         2.22
      48.799     0.600000        11767         2.50
      49.983     0.650000        12765         2.86
      51.039     0.700000        13733         3.33
      52.799     0.750000        14710         4.00
      53.951     0.775000        15194         4.44
      55.327     0.800000        15689         5.00
      57.055     0.825000        16175         5.71
      59.007     0.850000        16664         6.67
      61.119     0.875000        17152         8.00
      62.015     0.887500        17405         8.89
      62.591     0.900000        17644        10.00
      63.263     0.912500        17895        11.43
      64.319     0.925000        18136        13.33
      65.439     0.937500        18376        16.00
      66.367     0.943750        18499        17.78
      67.839     0.950000        18622        20.00
      70.847     0.956250        18743        22.86
      77.503     0.962500        18865        26.67
      86.911     0.968750        18988        32.00
      89.919     0.971875        19049        35.56
      90.815     0.975000        19112        40.00
      91.839     0.978125        19175        45.71
      92.863     0.981250        19234        53.33
      93.951     0.984375        19295        64.00
      95.039     0.985938        19328        71.11
      95.935     0.987500        19355        80.00
      97.919     0.989062        19386        91.43
      99.967     0.990625        19417       106.67
     103.679     0.992188        19447       128.00
     106.815     0.992969        19463       142.22
     108.927     0.993750        19478       160.00
     110.527     0.994531        19494       182.86
     111.935     0.995313        19509       213.33
     113.343     0.996094        19524       256.00
     115.519     0.996484        19532       284.44
     123.519     0.996875        19539       320.00
     128.383     0.997266        19547       365.71
     131.583     0.997656        19555       426.67
     142.079     0.998047        19562       512.00
     156.031     0.998242        19566       568.89
     175.743     0.998437        19570       640.00
     579.583     0.998633        19574       731.43
     581.631     0.998828        19578       853.33
     588.287     0.999023        19581      1024.00
     589.311     0.999121        19583      1137.78
     596.479     0.999219        19585      1280.00
     626.687     0.999316        19587      1462.86
     639.487     0.999414        19589      1706.67
     642.047     0.999512        19591      2048.00
     642.559     0.999561        19592      2275.56
     643.071     0.999609        19593      2560.00
     647.167     0.999658        19594      2925.71
     651.775     0.999707        19595      3413.33
     657.919     0.999756        19596      4096.00
     657.919     0.999780        19596      4551.11
     660.479     0.999805        19597      5120.00
     660.479     0.999829        19597      5851.43
     670.207     0.999854        19598      6826.67
     670.207     0.999878        19598      8192.00
     670.207     0.999890        19598      9102.22
     679.423     0.999902        19599     10240.00
     679.423     0.999915        19599     11702.86
     679.423     0.999927        19599     13653.33
     679.423     0.999939        19599     16384.00
     679.423     0.999945        19599     18204.44
     720.383     0.999951        19600     20480.00
     720.383     1.000000        19600          inf
#[Mean    =       48.945, StdDeviation   =       25.593]
#[Max     =      719.872, Total count    =        19600]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23603 requests in 1.00m, 13.53MB read
Requests/sec:    393.07
Transfer/sec:    230.70KB