results/4-loadtest/aws_results/aws_go_10.txt
Running 1m test @ https://zz5urfwt50.execute-api.eu-central-1.amazonaws.com/test/go_matrix
  2 threads and 10 connections
  Thread calibration: mean lat.: 67.919ms, rate sampling interval: 130ms
  Thread calibration: mean lat.: 54.867ms, rate sampling interval: 117ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    39.98ms    8.44ms  90.94ms   72.80%
    Req/Sec     5.02     12.47    43.00     87.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   42.37ms
 75.000%   45.34ms
 90.000%   47.84ms
 99.000%   66.62ms
 99.900%   91.01ms
 99.990%   91.01ms
 99.999%   91.01ms
100.000%   91.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      27.567     0.000000            1         1.00
      30.447     0.100000           50         1.11
      31.599     0.200000          100         1.25
      32.639     0.300000          151         1.43
      34.335     0.400000          200         1.67
      42.367     0.500000          250         2.00
      43.007     0.550000          275         2.22
      43.679     0.600000          300         2.50
      44.287     0.650000          326         2.86
      44.959     0.700000          352         3.33
      45.343     0.750000          376         4.00
      45.535     0.775000          388         4.44
      45.823     0.800000          400         5.00
      46.175     0.825000          415         5.71
      46.431     0.850000          425         6.67
      47.007     0.875000          438         8.00
      47.359     0.887500          445         8.89
      47.839     0.900000          451        10.00
      48.127     0.912500          458        11.43
      48.671     0.925000          463        13.33
      50.751     0.937500          469        16.00
      52.159     0.943750          472        17.78
      52.543     0.950000          475        20.00
      53.439     0.956250          480        22.86
      54.751     0.962500          482        26.67
      55.039     0.968750          485        32.00
      56.127     0.971875          486        35.56
      60.703     0.975000          488        40.00
      63.199     0.978125          490        45.71
      63.231     0.981250          491        53.33
      64.319     0.984375          493        64.00
      64.319     0.985938          493        71.11
      65.855     0.987500          494        80.00
      66.623     0.989062          495        91.43
      66.751     0.990625          496       106.67
      68.223     0.992188          497       128.00
      68.223     0.992969          497       142.22
      68.223     0.993750          497       160.00
      68.799     0.994531          498       182.86
      68.799     0.995313          498       213.33
      69.631     0.996094          499       256.00
      69.631     0.996484          499       284.44
      69.631     0.996875          499       320.00
      69.631     0.997266          499       365.71
      69.631     0.997656          499       426.67
      91.007     0.998047          500       512.00
      91.007     1.000000          500          inf
#[Mean    =       39.980, StdDeviation   =        8.439]
#[Max     =       90.944, Total count    =          500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 1.00m, 328.63KB read
Requests/sec:     10.03
Transfer/sec:      5.47KB